Repository: kghandour/KGPassGen
Catalog: lib/l10n/app_*.arb
Languages: ar

# homePage
source: Home
ar: الصفحة الرئيسية

source: Settings
ar: الاعدادات

# newConfig
source: New
ar: اضف اعداد

source: Delete
ar: حذف اعداد

source: Rename
ar: اعادة تسمية

source: Save
ar: حفظ

# renameTextField
source: Rename Configuration
ar: اعادة تسمية

source: Last Modified
ar: اخر تعديل

source: Configuration Settings
ar: اعدادات خاصة

source: Hashing Algorithm
ar: خوارزمية التجزئة

# hashingAlgorithmDescription
source: Options: KGPG generates a higher complexity passwords that must contain Uppercase, lowercase, symbols and numbers. SGP generates a password that contains Uppercase, lowercase and numbers.
ar: الخيارات: KGPG يُنشئ كلمات مرور عالية التعقيد يجب أن تحتوي على أحرف كبيرة وأحرف صغيرة ورموز وأرقام. SGP ينشئ كلمة مرور تحتوي على أحرف كبيرة وصغيرة وأرقام.

source: Hashing Function
ar: عمل التجزئة

# hashingFunctionDescription
source: Options: MD5 or SHA512.
ar: الخيارات: MD5 او SHA512.

# generatedPWLength
source: Generated Password Length
ar: طول كلمة المرور

# validatePassword
source: Validate Input Password
ar: تحقق من صحة إدخال كلمة المرور

# stripSubdomain
source: Strip Subdomain and Port
ar: تجريد العنوان الفرعي و المخرج

# backToHome
source: Back to Homepage
ar: العودة الي الصفحة الرئيسية

source: General Settings
ar: الاعدادات العامة

# appLanguage
source: Application Language
ar: لغة البرنامج

source: Dark Mode
ar: تشغيل النظام الليلي

# websiteLabel
source: Website URL
ar: رابط الموقع

# websiteFieldHint
source: Enter the website URL
ar: ادخل رابط الموقع

# masterPasswordLabel
source: Master Password
ar: كلمة السر الرئيسية

# masterPasswordHint
source: Enter the master password
ar: ادخل كلمة السر الرئيسية

source: Show Password
ar: اظهار كلمة السر

source: Generate Password
ar: إنشاء كلمة المرور

# fieldValidation
source: Field cannot be empty
ar: لا يمكن أن يكون الخانة فارغًا

# urlValidation
source: Please enter a valid url or ip address
ar: الرجاء إدخال عنوان url أو عنوان IP صالح

# passwordValidation
source: Password must include a lowercase and an uppercase character, a number and a symbol. It must also be a minimum of 8 characters and only English(latin) letters.
ar: يجب أن تتضمن كلمة المرور أحرفًا صغيرة وكبيرة ورقمًا ورمزًا. يجب أن يكون الحد الأدنى من 8 أحرف و تستخدم احرف انجليزية فقط

source: Copy
ar: نقل

# copyPasswordMessage
source: Generated Password copied to clipboard
ar: تم نقل كلمة المرور

source: Reset to defaults
ar: اعادة الاعدادات الى الحالة الاولية

source: What's New
ar: ما هو جديد

source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyText
source: Karim ElGhandour operates the kghandour.com website, which provides the KGPassGen. This page is used to inform website visitors regarding our policies with the collection, use, and disclosure of Personal Information if anyone decided to use our Service, the KGPassGen website. If you choose to use our Service, then you agree to the collection and use of information in relation with this policy. The Personal Information that we collect are used for providing and improving the Service. We will not use or share your information with anyone except as described in this Privacy Policy. Information Collection and Use KG Password Generator DOES NOT and WILL NOT collect any private information such as your passwords/websites you use this generator for. All the processing happens on your device ALONE. There is no backend server or database that stores anything that concerns your passwords/websites/settings or anything of that sort. We do not collect information such as your name, email, postal address or phone number. Log Data We want to inform you that whenever you visit our website (Applications are not included), we collect information that your browser sends to us that is called Log Data. This Log Data may include information such as your computer’s Internet Protocol ("IP") address, browser version, pages of our Service that you visit, the time and date of your visit, and other statistics. Cookies Cookies are files with small amount of data that is commonly used an anonymous unique identifier. These are sent to your browser from the website that you visit and are stored on your computer’s hard drive. Our website does NOT include any cookies of any kind. Service Providers We may employ third_party companies and individuals due to the following reasons: To facilitate our Service; To provide the Service on our behalf; To perform Service_related services; We want to inform our Service users that these third parties have access to your Log Data . The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose. Security We value your trust in providing us your Log Data, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security. Links to Other Sites Our Service may contain links to other sites. If you click on a third_party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third_party sites or services. Changes to This Privacy Policy We may update our Privacy Policy from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately, after they are posted on this page. Contact Us If you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us.
ar: كريم الغندور يدير موقع kghandour.com ، الذي يوفر KGPassGen. تُستخدم هذه الصفحة لإعلام زوار الموقع فيما يتعلق بسياساتنا من خلال جمع المعلومات الشخصية واستخدامها والكشف عنها إذا قرر أي شخص استخدام خدمتنا ، موقع KGPassGen. إذا اخترت استخدام خدمتنا ، فأنت توافق على جمع المعلومات واستخدامها فيما يتعلق بهذه السياسة. تُستخدم المعلومات الشخصية التي نجمعها لتوفير الخدمة وتحسينها. ولن نستخدم معلوماتك أو نشاركها مع أي شخص باستثناء ما هو موصوف في سياسة الخصوصية هذه. جمع المعلومات واستخدامها KG Password Generator لا ولن يقوم بجمع أي معلومات خاصة مثل كلمات المرور / مواقع الويب التي تستخدم هذا المولد من أجلها. تتم جميع عمليات المعالجة على جهازك بمفردك. لا يوجد خادم أو قاعدة بيانات خلفية تخزن أي شيء يتعلق بكلمات المرور / مواقع الويب / الإعدادات الخاصة بك أو أي شيء من هذا القبيل. نحن لا نجمع معلومات مثل اسمك أو بريدك الإلكتروني أو نقطة البيع tal أو رقم الهاتف. بيانات السجل نريد إبلاغك أنه كلما زرت خدمتنا ، نقوم بجمع المعلومات التي يرسلها متصفحك إلينا والتي تسمى بيانات السجل. قد تتضمن بيانات السجل هذه معلومات مثل عنوان بروتوكول الإنترنت ("IP ") لجهاز الكمبيوتر الخاص بك ، وإصدار المستعرض ، وصفحات الخدمة التي تزورها ، ووقت وتاريخ زيارتك ، وإحصائيات أخرى. ملفات تعريف الارتباط ملفات تعريف الارتباط هي ملفات بكمية صغيرة من البيانات التي يشيع استخدامها كمعرف فريد مجهول. يتم إرسالها إلى المستعرض الخاص بك من موقع الويب الذي تزوره ويتم تخزينها على محرك الأقراص الثابتة بجهاز الكمبيوتر الخاص بك. لا يتضمن موقع الويب الخاص بنا أي ملفات تعريف ارتباط من أي نوع. موفرو الخدمات يجوز لنا توظيف شركات وأفراد تابعين لجهات خارجية بسبب ما يلي الأسباب: لتسهيل خدمتنا ؛ لتقديم الخدمة نيابة عنا ؛ لأداء الخدمات المتعلقة بالخدمة ؛ نريد إبلاغ مستخدمي خدمتنا أن هذه الأطراف الثالثة لديها حق الوصول إلى بيانات السجل الخاصة بك. والسبب هو أداء المهام الموكلة إليهم نيابة عنا. ومع ذلك ، فهم ملزمون بعدم الكشف عن المعلومات أو استخدامها لأي غرض آخر. الأمان نحن نقدر ثقتك في تزويدنا ببيانات السجل الخاصة بك ، وبالتالي فإننا نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحمايتها. لكن تذكر أنه لا توجد وسيلة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة وموثوقة بنسبة 100٪ ، ولا يمكننا ضمان أمانها المطلق. الروابط بمواقع أخرى قد تحتوي خدمتنا على ارتباطات بمواقع أخرى. إذا قمت بالنقر فوق ارتباط جهة خارجية ، فسيتم توجيهك إلى هذا الموقع. لاحظ أن هذه المواقع الخارجية لا يتم تشغيلها بواسطتنا. لذلك ، ننصحك بشدة بمراجعة سياسة الخصوصية الخاصة بهذه المواقع. ليس لدينا أي سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات الخصوصية أو الممارسات الخاصة بأي مواقع أو خدمات تابعة لجهات خارجية. التغييرات على سياسة الخصوصية هذه قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من حين لآخر الى وقت. وبالتالي ، ننصحك بمراجعة هذه الصفحة بشكل دوري لأية تغييرات. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة. تسري هذه التغييرات فور نشرها على هذه الصفحة. اتصل بنا إذا كانت لديك أية أسئلة أو اقتراحات حول سياسة الخصوصية الخاصة بنا ، فلا تتردد في الاتصال بنا.

# getOtherDevices
source: Get KG Pass Gen for all your different devices
ar: احصل على KG Pass Gen لجميع أجهزتك المختلفة

# getOtherDevicesText
source: KG Pass Gen is available on all platforms! It is built with Flutter and thus it is available for Windows, MacOS, Linux, Android, iOS and Web!
ar: KG Pass Gen متاح على جميع المنصات! تم تصميمه باستخدام Flutter وبالتالي فهو متاح لأنظمة Windows و MacOS و Linux و Android و iOS و Web!

# whatsNewLaunchWeb
source: Launch Web Version
ar: فتح إصدار الويب

# whatsNewLaunchGithub
source: Launch Github Repository
ar: فتح Github Repository

# whatsNewLaunchDownload
source: Launch Download page
ar: فتح صفحة التنزيل

# whatsNewLaunchPlaystore
source: Launch Google Playstore
ar: فتح متجر Google Playstore

# whatsNewAbout
source: About KG Pass Gen
ar: معلومات عن KG Pass Gen

# whatsNewAboutText
source: • KG Pass Gen is a fully open_source password generator that is based on SuperGenPass while focusing on making your passwords more secure. • KG Pass Gen uses a set of Hashing function _ one way hashing _ to concatenate the website and the master password then hashes them using MD5 or SHA512. KG Pass Gen then iteratively keep on hashing the output until it satisfies the password requirements.
ar: • KG Pass Gen عبارة عن مولد كلمات مرور مفتوح المصدر بالكامل يعتمد على SuperGenPass مع التركيز على جعل كلمات المرور أكثر أمانًا. • يستخدم KG Pass Gen مجموعة من وظائف التجزئة _ طريقة واحدة للتجزئة _ لتوصيل موقع الويب و تقوم كلمة المرور الرئيسية بعد ذلك بتجزئتها باستخدام MD5 أو SHA512. ثم يستمر KG Pass Gen بشكل متكرر في تجزئة الإخراج حتى يفي بمتطلبات كلمة المرور.

# whatsNewEasterEggTitle
source: You found the Easter Egg!
ar: لقد وجدت الرسالة المخفية

# whatsNewEasterEggText
source: Just wanted to say, thank you for using this. Wanted to also tell you this: Never stop creating. Whatever your profession, no matter how busy you get in life, take a deep breathe, and spend time on what is important to you. Do your hoobbies, get better at them, spend time with your family and friends. You are never alone. One last thing: Never stop being awesome. Also, I wonder if anyone actually found this? If you did why don't you let me know? If there is something I can do for you, reach out @itsKGhandour on Twitter.
ar: أردت فقط أن أقول ، شكرًا لك على استخدام KG Pass Gen. أردت أيضًا أن أخبرك بهذا: لا تتوقف أبدًا عن الإنشاء. مهما كانت مهنتك ، بغض النظر عن مدى انشغالك في الحياة ، خذ نفسًا عميقًا واقض بعض الوقت في ما هو مهم بالنسبة لك. مارس هواياتك ، وتحسن فيها ، واقضِ الوقت مع عائلتك وأصدقائك. لست وحدك أبدًا. شيء أخير: لا تتوقف أبدًا عن كونك رائعًا. أيضًا ، أتساءل عما إذا كان أي شخص قد وجد هذا بالفعل؟ إذا فعلت فلماذا لا تخبرني؟ إذا كان هناك شيء يمكنني القيام به من أجلك ، فتواصل معitsKGhandour على Twitter.

# whatsNewEasterEggButton
source: I will stay Awesome.
ar: هفضل رائع

# whatsNewEasterEggSnackBar
source: Wait. Whats that? Press again...
ar: استنى. دوس تاني كدة.

# splashTitle
source: Splash
ar: مرشد

# splash_1_1_title
source: One password to rule them all
ar: كلمة مرور واحدة للحكم عليهم جميعًا

# splash_1_1_subtitle
source: Now you only need to know one (master) password and KG Pass Generator will create a unique password for each website that you would like to visit
ar: الآن ما عليك سوى معرفة كلمة مرور (رئيسية) واحدة وسيقوم KG Pass Generator بإنشاء كلمة مرور فريدة لكل موقع ويب ترغب في زيارته

# splash_1_2_title
source: More security for you
ar: المزيد من الأمان لك

# splash_1_2_subtitle
source: Even if one website you use gets hacked, your other accounts are still secure. Never use the same password for more than one website.
ar: حتى في حالة اختراق أحد مواقع الويب التي تستخدمها ، تظل حساباتك الأخرى آمنة. لا تستخدم أبدًا نفس كلمة المرور لأكثر من موقع ويب.

# splash_1_3_title
source: Everything is on your device
ar: كل شيء موجود على جهازك

# splash_1_3_subtitle
source: Fully Open_source. Completely free. Nothing is transmitted.
ar: مفتوح المصدر بالكامل. مجاني تماما. لا شيء ينتقل.

# splash_2_title
source: Easy interface
ar: واجهة سهلة

# splash_2_subtitle
source: Simply type in the website you want to generate a password for, type in a master password that you will memorize, and press on generate. KGPassGen will generate a strong password that will be specific to the website you entered.
ar: ما عليك سوى كتابة موقع الويب الذي تريد إنشاء كلمة مرور له ، واكتب كلمة مرور رئيسية ستحفظها ، ثم اضغط على إنشاء. سيقوم KGPassGen بإنشاء كلمة مرور قوية تكون خاصة بموقع الويب الذي أدخلته.

# splash_3_title
source: Multiple Configurations, Languages and Darkmode!
ar: تكوينات ولغات متعددة والوضع المظلم!

# splash_3_subtitle
source: You can dedicate configurations for specific services that you use. Moreover, KGPassgen now comes with support for English and Arabic and we will work on more languages.
ar: يمكنك تخصيص عمليات التهيئة لخدمات معينة تستخدمها. يأتي برنامج KGPassgen مع دعم للغة الإنجليزية والعربية وسنعمل على المزيد من اللغات.

source: Next
ar: التالي

source: Back
ar: العودة

source: Get Started
ar: ابدأ

source: Skip
ar: تخطي
